"""
================================================================================
ID: 4
Тема: Один проход по массиву / строке
Название: Проверить, есть ли дубликаты
Сложность: Easy
--------------------------------------------------------------------------------
Условие:
Дан массив целых чисел. Проверить, есть ли в массиве дубликаты за один проход.

Пример:
Вход: [1, 2, 3, 2, 4]
Выход: True

Вход: [1, 2, 3, 4, 5]
Выход: False
================================================================================
"""


def check_dubs(arr):
    uniq_els = set()

    for i in arr:
        if i in uniq_els:
            return True

        uniq_els.add(i)

    return False




print(check_dubs([1, 2, 3, 2, 4]))
print(check_dubs([1, 2, 3, 4, 5]))
