"""
================================================================================
ID: 10
Тема: Один проход по массиву / строке
Название: Найти индексы всех вхождений элемента
Сложность: Easy
--------------------------------------------------------------------------------
Условие:
Дан массив и элемент. Найти индексы всех вхождений этого элемента за один проход.

Пример:
Вход: [1, 2, 3, 2, 4, 2], элемент = 2
Выход: [1, 3, 5]
================================================================================
"""

def find_ixs(arr, el):
    res = []

    for i in range(len(arr)):
        if arr[i] == el:
            res.append(i)

    return res

print(find_ixs([1, 2, 3, 2, 4, 2], 2))
