"""
================================================================================
ID: 8
Тема: Один проход по массиву / строке
Название: Проверить, является ли строка палиндромом
Сложность: Easy
--------------------------------------------------------------------------------
Условие:
Проверить, является ли строка палиндромом (читается одинаково слева направо и справа налево). Игнорировать регистр и пробелы.

Пример:
Вход: "A man a plan a canal Panama"
Выход: True

Вход: "hello"
Выход: False
================================================================================
"""

def palindrome_check(in_str):
    in_str = in_str.replace(" ", "").lower()

    i, j = 0, len(in_str)-1

    while i < j:
        if in_str[i] != in_str[j]:
            return False
        
        i += 1
        j -= 1
    
    print(len(in_str), in_str, i, j)

    return True


print(palindrome_check("hello"))
print(palindrome_check("A man a plan a anal Panama"))
